{"Age:": "Age", "Gender:": "Gender", "Civil Status:": "Civil Status", "1. Are you employed?": "Employment Status", "If yes, please describe your employment situation (e.g., full-time, part-time, remote, etc.) and how it supports your ability to care for a pet. If your answer is no, please indicate 'None'.": "Employment Details", "2. Are you genuinely interested in adopting a pet?": "Interest in Adoption", "Please explain why you want to adopt a pet, or why you do not want to adopt one.": "Adoption Reason", "3. Do you own your home or rent?": "Housing Ownership", "If renting, do you have permission from your landlord to have pets? If your answer is own, please indicate 'None'.": "Landlord Pet Permission", "4. Is your area gated?": "Gated Community Status", "If your answer is no, how can we ensure the safety of the pet? If your answer is yes, please indicate 'None'.": "Pet Safety Assurance", "5. Will your pet primarily stay indoors or outdoors?": "Pet Living Environment", "If outdoors, please describe the outdoor setup, including the size of the area, type of shelter provided, and how you will ensure the pet's safety and comfort outdoors. If your answer is indoors, please indicate 'None'.": "Outdoor Setup Details", "6. Do you have children in your household?": "Children in Household", "If yes, please list their ages and how they interact with pets. If your answer is no, please indicate 'None'.": "Children Ages and Pet Interaction", " 7. Do any household members have allergies to pets?": "Household Pet Allergies", "If yes, how do you manage these allergies? If your answer is no, please indicate 'None'.": "Allergy Management", " 8. Is your family prepared to welcome a new family member and commit to their lifelong care?": "Family Commitment to Pet", "If yes, please explain how you will take care of the pet. If your answer is no, please explain how you will still take care of the pet.": "Pet Care Plan", "1. What species of pet have you adopted before? If you have no previous pet adoption experience, please choose 'None'.": "Previous Pet Species", "Please describe your experience with this pet. If you have no previous pet adoption experience, please indicate 'None'.": "Previous Pet Experience", "2. What was the age category of your pet at the time of adoption? If you have no previous pet adoption experience, please choose 'None'.": "Previous Pet Age Category", "Why did you choose this age when adopting your previous pet(s)? If you have no previous pet adoption experience, please indicate 'None'.": "Previous Pet Choice of Age Reason", "3. What was the gender of the pet you have adopted? If you have no previous pet adoption experience, please choose 'None'.": "Previous Pet Gender", "Did the gender influence your choice? Why or why not? If you have no previous pet adoption experience, please indicate 'None'.": "Previous Pet's Gender Choice Reason", "4. What is the story behind your adopted pet? If you have no previous pet adoption experience, please choose 'None'.": "Previous Pet History", "Please share more details about the adoption/rescue story. If you have no previous pet adoption experience, please indicate 'None'.": "Previous Pet History Details", "5. What was the spay/neuter status of your pet at the time of adoption? If you have no previous pet adoption experience, please choose 'None'.": "Previous Pet Spay/Neuter Status", "Why was this important to you? If you have no previous pet adoption experience, please indicate 'None'.": "Previous Pet Spay/Neuter Importance", "6. What was the vaccination status of your pet at the time of adoption? If you have no previous pet adoption experience, please choose 'None'.": "Previous Pet Vaccinations Status", "How did you handle their vaccination needs? If you have no previous pet adoption experience, please indicate 'None'.": "Previous Pet Vaccination Management", "7. What was the temperament of your adopted pet? If you have no previous pet adoption experience, please choose 'None'.": "Previous Pet Temperament", "How did you manage their temperament? If you have no previous pet adoption experience, please indicate 'None'.": "Previous Pet Temperament Management", "1. Vaccinations are highly encouraged for the survival of cats and dogs. Are you willing to provide all needed vaccinations for your new pet?": "New Pet Vaccination Willingness", "If yes, please describe your plan for ensuring your new pet receives all necessary vaccinations. If no, please explain why.": "New Pet Vaccination Plan", "2. Are you willing to sponsor the spay and neuter of your adopted pet?": "Spay/Neuter Willingness", "If yes, please describe your plan for arranging and financing the spay and neuter procedure for your new pet. If no, please explain why.": "New Pet Spay/Neuter Plan", "3. If you transfer to a new house/new location, will you bring the pet with you?": "Pet Transfer Willingness", "If no, please explain under what circumstances you might not bring the pet with you. If your answer is yes, please indicate 'None.'": "New Pet Transfer Reason", "4. Are you prepared for the long-term commitment of pet ownership, which can extend beyond 10-20 years?": "New Pet Long Term Commitment", "If yes, please explain why you are ready for this commitment and how you plan to provide for the pet's needs over its lifetime. If no, please explain why.": "New Pet Commitment Plan Details", "5. We will contact you periodically to get updates on the pet. Is this okay with you?": "Follow_Up Permission", "If no, please specify the reason why. If your answer is yes, please indicate 'None.'": "Unavailable Contact Reason"}